STMicroelectronics/stm32-ism330dlc/ism330dlc_reg.h
int32_t ism330dlc_read_reg(stmdev_ctx_t *ctx, uint8_t reg,
                           uint8_t *data,
                           uint16_t len);
int32_t ism330dlc_write_reg(stmdev_ctx_t *ctx, uint8_t reg,
                            uint8_t *data,
                            uint16_t len);

float_t ism330dlc_from_fs2g_to_mg(int16_t lsb);
float_t ism330dlc_from_fs4g_to_mg(int16_t lsb);
float_t ism330dlc_from_fs8g_to_mg(int16_t lsb);
float_t ism330dlc_from_fs16g_to_mg(int16_t lsb);

float_t ism330dlc_from_fs125dps_to_mdps(int16_t lsb);
float_t ism330dlc_from_fs250dps_to_mdps(int16_t lsb);
float_t ism330dlc_from_fs500dps_to_mdps(int16_t lsb);
float_t ism330dlc_from_fs1000dps_to_mdps(int16_t lsb);
float_t ism330dlc_from_fs2000dps_to_mdps(int16_t lsb);

float_t ism330dlc_from_lsb_to_celsius(int16_t lsb);

typedef enum {
  ISM330DLC_2g       = 0,
  ISM330DLC_16g      = 1,
  ISM330DLC_4g       = 2,
  ISM330DLC_8g       = 3,
  ISM330DLC_XL_FS_ND = 4,  /* ERROR CODE */
} ism330dlc_fs_xl_t;
int32_t ism330dlc_xl_full_scale_set(stmdev_ctx_t *ctx,
                                    ism330dlc_fs_xl_t val);
int32_t ism330dlc_xl_full_scale_get(stmdev_ctx_t *ctx,
                                    ism330dlc_fs_xl_t *val);

typedef enum {
  ISM330DLC_XL_ODR_OFF      =  0,
  ISM330DLC_XL_ODR_12Hz5    =  1,
  ISM330DLC_XL_ODR_26Hz     =  2,
  ISM330DLC_XL_ODR_52Hz     =  3,
  ISM330DLC_XL_ODR_104Hz    =  4,
  ISM330DLC_XL_ODR_208Hz    =  5,
  ISM330DLC_XL_ODR_416Hz    =  6,
  ISM330DLC_XL_ODR_833Hz    =  7,
  ISM330DLC_XL_ODR_1k66Hz   =  8,
  ISM330DLC_XL_ODR_3k33Hz   =  9,
  ISM330DLC_XL_ODR_6k66Hz   = 10,
  ISM330DLC_XL_ODR_1Hz6     = 11,
} ism330dlc_odr_xl_t;
int32_t ism330dlc_xl_data_rate_set(stmdev_ctx_t *ctx,
                                   ism330dlc_odr_xl_t val);
int32_t ism330dlc_xl_data_rate_get(stmdev_ctx_t *ctx,
                                   ism330dlc_odr_xl_t *val);

typedef enum {
  ISM330DLC_250dps   = 0,
  ISM330DLC_125dps   = 1,
  ISM330DLC_500dps   = 2,
  ISM330DLC_1000dps  = 4,
  ISM330DLC_2000dps  = 6,
} ism330dlc_fs_g_t;
int32_t ism330dlc_gy_full_scale_set(stmdev_ctx_t *ctx,
                                    ism330dlc_fs_g_t val);
int32_t ism330dlc_gy_full_scale_get(stmdev_ctx_t *ctx,
                                    ism330dlc_fs_g_t *val);

typedef enum {
  ISM330DLC_GY_ODR_OFF    =  0,
  ISM330DLC_GY_ODR_12Hz5  =  1,
  ISM330DLC_GY_ODR_26Hz   =  2,
  ISM330DLC_GY_ODR_52Hz   =  3,
  ISM330DLC_GY_ODR_104Hz  =  4,
  ISM330DLC_GY_ODR_208Hz  =  5,
  ISM330DLC_GY_ODR_416Hz  =  6,
  ISM330DLC_GY_ODR_833Hz  =  7,
  ISM330DLC_GY_ODR_1k66Hz =  8,
  ISM330DLC_GY_ODR_3k33Hz =  9,
  ISM330DLC_GY_ODR_6k66Hz = 10,
} ism330dlc_odr_g_t;
int32_t ism330dlc_gy_data_rate_set(stmdev_ctx_t *ctx,
                                   ism330dlc_odr_g_t val);
int32_t ism330dlc_gy_data_rate_get(stmdev_ctx_t *ctx,
                                   ism330dlc_odr_g_t *val);

int32_t ism330dlc_block_data_update_set(stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t ism330dlc_block_data_update_get(stmdev_ctx_t *ctx,
                                        uint8_t *val);

typedef enum {
  ISM330DLC_LSb_1mg  = 0,
  ISM330DLC_LSb_16mg = 1,
} ism330dlc_usr_off_w_t;
int32_t ism330dlc_xl_offset_weight_set(stmdev_ctx_t *ctx,
                                       ism330dlc_usr_off_w_t val);
int32_t ism330dlc_xl_offset_weight_get(stmdev_ctx_t *ctx,
                                       ism330dlc_usr_off_w_t *val);

typedef enum {
  ISM330DLC_XL_HIGH_PERFORMANCE  = 0,
  ISM330DLC_XL_NORMAL            = 1,
} ism330dlc_xl_hm_mode_t;
int32_t ism330dlc_xl_power_mode_set(stmdev_ctx_t *ctx,
                                    ism330dlc_xl_hm_mode_t val);
int32_t ism330dlc_xl_power_mode_get(stmdev_ctx_t *ctx,
                                    ism330dlc_xl_hm_mode_t *val);

typedef enum {
  ISM330DLC_STAT_RND_DISABLE  = 0,
  ISM330DLC_STAT_RND_ENABLE   = 1,
} ism330dlc_rounding_status_t;
int32_t ism330dlc_rounding_on_status_set(stmdev_ctx_t *ctx,
                                         ism330dlc_rounding_status_t val);
int32_t ism330dlc_rounding_on_status_get(stmdev_ctx_t *ctx,
                                         ism330dlc_rounding_status_t *val);

typedef enum {
  ISM330DLC_GY_HIGH_PERFORMANCE  = 0,
  ISM330DLC_GY_NORMAL            = 1,
} ism330dlc_g_hm_mode_t;
int32_t ism330dlc_gy_power_mode_set(stmdev_ctx_t *ctx,
                                    ism330dlc_g_hm_mode_t val);
int32_t ism330dlc_gy_power_mode_get(stmdev_ctx_t *ctx,
                                    ism330dlc_g_hm_mode_t *val);

typedef struct {
  ism330dlc_wake_up_src_t        wake_up_src;
  ism330dlc_tap_src_t            tap_src;
  ism330dlc_d6d_src_t            d6d_src;
  ism330dlc_status_reg_t         status_reg;
  ism330dlc_func_src1_t          func_src1;
  ism330dlc_func_src2_t          func_src2;
} ism330dlc_all_sources_t;
int32_t ism330dlc_all_sources_get(stmdev_ctx_t *ctx,
                                  ism330dlc_all_sources_t *val);

int32_t ism330dlc_status_reg_get(stmdev_ctx_t *ctx,
                                 ism330dlc_status_reg_t *val);

int32_t ism330dlc_xl_flag_data_ready_get(stmdev_ctx_t *ctx,
                                         uint8_t *val);

int32_t ism330dlc_gy_flag_data_ready_get(stmdev_ctx_t *ctx,
                                         uint8_t *val);

int32_t ism330dlc_temp_flag_data_ready_get(stmdev_ctx_t *ctx,
                                           uint8_t *val);

int32_t ism330dlc_xl_usr_offset_set(stmdev_ctx_t *ctx, uint8_t *buff);
int32_t ism330dlc_xl_usr_offset_get(stmdev_ctx_t *ctx, uint8_t *buff);
int32_t ism330dlc_timestamp_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_timestamp_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DLC_LSB_6ms4 = 0,
  ISM330DLC_LSB_25us = 1,
} ism330dlc_timer_hr_t;
int32_t ism330dlc_timestamp_res_set(stmdev_ctx_t *ctx,
                                    ism330dlc_timer_hr_t val);
int32_t ism330dlc_timestamp_res_get(stmdev_ctx_t *ctx,
                                    ism330dlc_timer_hr_t *val);

