STMicroelectronics/stm32-ism330dlc/ism330dlc_reg.h
typedef enum {
  ISM330DLC_XL_UI_LP1_ODR_DIV_2 = 0,
  ISM330DLC_XL_UI_LP1_ODR_DIV_4 = 1,
  ISM330DLC_XL_UI_LP1_NA        = 2,  /* ERROR CODE */
} ism330dlc_ui_lpf1_bw_sel_t;
int32_t ism330dlc_xl_ui_lp1_bandwidth_set(stmdev_ctx_t *ctx,
                                          ism330dlc_ui_lpf1_bw_sel_t val);
int32_t ism330dlc_xl_ui_lp1_bandwidth_get(stmdev_ctx_t *ctx,
                                          ism330dlc_ui_lpf1_bw_sel_t *val);

int32_t ism330dlc_xl_ui_slope_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_xl_ui_slope_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DLC_AUX_LP_LIGHT          = 2,
  ISM330DLC_AUX_LP_NORMAL         = 3,
  ISM330DLC_AUX_LP_STRONG         = 0,
  ISM330DLC_AUX_LP_AGGRESSIVE     = 1,
} ism330dlc_filter_xl_conf_ois_t;
int32_t ism330dlc_xl_aux_lp_bandwidth_set(stmdev_ctx_t *ctx,
                                          ism330dlc_filter_xl_conf_ois_t val);
int32_t ism330dlc_xl_aux_lp_bandwidth_get(stmdev_ctx_t *ctx,
                                          ism330dlc_filter_xl_conf_ois_t *val);

typedef enum {
  ISM330DLC_LP2_ONLY                    = 0x00,

  ISM330DLC_HP_16mHz_LP2                = 0x80,
  ISM330DLC_HP_65mHz_LP2                = 0x90,
  ISM330DLC_HP_260mHz_LP2               = 0xA0,
  ISM330DLC_HP_1Hz04_LP2                = 0xB0,

  ISM330DLC_HP_DISABLE_LP1_LIGHT        = 0x0A,
  ISM330DLC_HP_DISABLE_LP1_NORMAL       = 0x09,
  ISM330DLC_HP_DISABLE_LP_STRONG        = 0x08,
  ISM330DLC_HP_DISABLE_LP1_AGGRESSIVE   = 0x0B,

  ISM330DLC_HP_16mHz_LP1_LIGHT          = 0x8A,
  ISM330DLC_HP_65mHz_LP1_NORMAL         = 0x99,
  ISM330DLC_HP_260mHz_LP1_STRONG        = 0xA8,
  ISM330DLC_HP_1Hz04_LP1_AGGRESSIVE     = 0xBB,
} ism330dlc_lpf1_sel_g_t;
int32_t ism330dlc_gy_band_pass_set(stmdev_ctx_t *ctx,
                                   ism330dlc_lpf1_sel_g_t val);
int32_t ism330dlc_gy_band_pass_get(stmdev_ctx_t *ctx,
                                   ism330dlc_lpf1_sel_g_t *val);

int32_t ism330dlc_gy_ui_high_pass_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_gy_ui_high_pass_get(stmdev_ctx_t *ctx,
                                      uint8_t *val);

typedef enum {
  ISM330DLC_HP_DISABLE_LP_173Hz        = 0x02,
  ISM330DLC_HP_DISABLE_LP_237Hz        = 0x01,
  ISM330DLC_HP_DISABLE_LP_351Hz        = 0x00,
  ISM330DLC_HP_DISABLE_LP_937Hz        = 0x03,

  ISM330DLC_HP_16mHz_LP_173Hz          = 0x82,
  ISM330DLC_HP_65mHz_LP_237Hz          = 0x91,
  ISM330DLC_HP_260mHz_LP_351Hz         = 0xA0,
  ISM330DLC_HP_1Hz04_LP_937Hz          = 0xB3,
} ism330dlc_hp_en_ois_t;
int32_t ism330dlc_gy_aux_bandwidth_set(stmdev_ctx_t *ctx,
                                       ism330dlc_hp_en_ois_t val);
int32_t ism330dlc_gy_aux_bandwidth_get(stmdev_ctx_t *ctx,
                                       ism330dlc_hp_en_ois_t *val);

int32_t ism330dlc_aux_status_reg_get(stmdev_ctx_t *ctx,
                                     ism330dlc_status_spiaux_t *val);

int32_t ism330dlc_aux_xl_flag_data_ready_get(stmdev_ctx_t *ctx,
                                             uint8_t *val);

int32_t ism330dlc_aux_gy_flag_data_ready_get(stmdev_ctx_t *ctx,
                                             uint8_t *val);

int32_t ism330dlc_aux_gy_flag_settling_get(stmdev_ctx_t *ctx,
                                           uint8_t *val);

typedef enum {
  ISM330DLC_AUX_DEN_DISABLE         = 0,
  ISM330DLC_AUX_DEN_LEVEL_LATCH     = 3,
  ISM330DLC_AUX_DEN_LEVEL_TRIG      = 2,
} ism330dlc_lvl_ois_t;
int32_t ism330dlc_aux_den_mode_set(stmdev_ctx_t *ctx,
                                   ism330dlc_lvl_ois_t val);
int32_t ism330dlc_aux_den_mode_get(stmdev_ctx_t *ctx,
                                   ism330dlc_lvl_ois_t *val);

int32_t ism330dlc_aux_drdy_on_int2_set(stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t ism330dlc_aux_drdy_on_int2_get(stmdev_ctx_t *ctx,
                                       uint8_t *val);

typedef enum {
  ISM330DLC_AUX_DISABLE   = 0,
  ISM330DLC_MODE_3_GY     = 1,
  ISM330DLC_MODE_4_GY_XL  = 3,
} ism330dlc_ois_en_spi2_t;
int32_t ism330dlc_aux_mode_set(stmdev_ctx_t *ctx,
                               ism330dlc_ois_en_spi2_t val);
int32_t ism330dlc_aux_mode_get(stmdev_ctx_t *ctx,
                               ism330dlc_ois_en_spi2_t *val);

typedef enum {
  ISM330DLC_250dps_AUX   = 0,
  ISM330DLC_125dps_AUX   = 1,
  ISM330DLC_500dps_AUX   = 2,
  ISM330DLC_1000dps_AUX  = 4,
  ISM330DLC_2000dps_AUX  = 6,
} ism330dlc_fs_g_ois_t;
int32_t ism330dlc_aux_gy_full_scale_set(stmdev_ctx_t *ctx,
                                        ism330dlc_fs_g_ois_t val);
int32_t ism330dlc_aux_gy_full_scale_get(stmdev_ctx_t *ctx,
                                        ism330dlc_fs_g_ois_t *val);

typedef enum {
  ISM330DLC_AUX_SPI_4_WIRE = 0,
  ISM330DLC_AUX_SPI_3_WIRE = 1,
} ism330dlc_sim_ois_t;
int32_t ism330dlc_aux_spi_mode_set(stmdev_ctx_t *ctx,
                                   ism330dlc_sim_ois_t val);
int32_t ism330dlc_aux_spi_mode_get(stmdev_ctx_t *ctx,
                                   ism330dlc_sim_ois_t *val);

typedef enum {
  ISM330DLC_AUX_LSB_AT_LOW_ADD = 0,
  ISM330DLC_AUX_MSB_AT_LOW_ADD = 1,
} ism330dlc_ble_ois_t;
int32_t ism330dlc_aux_data_format_set(stmdev_ctx_t *ctx,
                                      ism330dlc_ble_ois_t val);
int32_t ism330dlc_aux_data_format_get(stmdev_ctx_t *ctx,
                                      ism330dlc_ble_ois_t *val);

typedef enum {
  ISM330DLC_ENABLE_CLAMP    = 0,
  ISM330DLC_DISABLE_CLAMP   = 1,
} ism330dlc_st_ois_clampdis_t;
int32_t ism330dlc_aux_gy_clamp_set(stmdev_ctx_t *ctx,
                                   ism330dlc_st_ois_clampdis_t val);
int32_t ism330dlc_aux_gy_clamp_get(stmdev_ctx_t *ctx,
                                   ism330dlc_st_ois_clampdis_t *val);

typedef enum {
  ISM330DLC_AUX_GY_DISABLE  = 0,
  ISM330DLC_AUX_GY_POS      = 1,
  ISM330DLC_AUX_GY_NEG      = 3,
} ism330dlc_st_ois_t;
int32_t ism330dlc_aux_gy_self_test_set(stmdev_ctx_t *ctx,
                                       ism330dlc_st_ois_t val);
int32_t ism330dlc_aux_gy_self_test_get(stmdev_ctx_t *ctx,
                                       ism330dlc_st_ois_t *val);

