STMicroelectronics/stm32-ism330dlc/ism330dlc_reg.h
typedef enum {
  ISM330DLC_FIFO_DISABLE   =  0,
  ISM330DLC_FIFO_12Hz5     =  1,
  ISM330DLC_FIFO_26Hz      =  2,
  ISM330DLC_FIFO_52Hz      =  3,
  ISM330DLC_FIFO_104Hz     =  4,
  ISM330DLC_FIFO_208Hz     =  5,
  ISM330DLC_FIFO_416Hz     =  6,
  ISM330DLC_FIFO_833Hz     =  7,
  ISM330DLC_FIFO_1k66Hz    =  8,
  ISM330DLC_FIFO_3k33Hz    =  9,
  ISM330DLC_FIFO_6k66Hz    = 10,
} ism330dlc_odr_fifo_t;
int32_t ism330dlc_fifo_data_rate_set(stmdev_ctx_t *ctx,
                                     ism330dlc_odr_fifo_t val);
int32_t ism330dlc_fifo_data_rate_get(stmdev_ctx_t *ctx,
                                     ism330dlc_odr_fifo_t *val);

typedef enum {
  ISM330DLC_DEN_ACT_LOW    = 0,
  ISM330DLC_DEN_ACT_HIGH   = 1,
} ism330dlc_den_lh_t;
int32_t ism330dlc_den_polarity_set(stmdev_ctx_t *ctx,
                                   ism330dlc_den_lh_t val);
int32_t ism330dlc_den_polarity_get(stmdev_ctx_t *ctx,
                                   ism330dlc_den_lh_t *val);

typedef enum {
  ISM330DLC_DEN_DISABLE    = 0,
  ISM330DLC_LEVEL_FIFO     = 6,
  ISM330DLC_LEVEL_LETCHED  = 3,
  ISM330DLC_LEVEL_TRIGGER  = 2,
  ISM330DLC_EDGE_TRIGGER   = 4,
} ism330dlc_den_mode_t;
int32_t ism330dlc_den_mode_set(stmdev_ctx_t *ctx,
                               ism330dlc_den_mode_t val);
int32_t ism330dlc_den_mode_get(stmdev_ctx_t *ctx,
                               ism330dlc_den_mode_t *val);

typedef enum {
  ISM330DLC_STAMP_IN_GY_DATA     = 0,
  ISM330DLC_STAMP_IN_XL_DATA     = 1,
  ISM330DLC_STAMP_IN_GY_XL_DATA  = 2,
} ism330dlc_den_xl_en_t;
int32_t ism330dlc_den_enable_set(stmdev_ctx_t *ctx,
                                 ism330dlc_den_xl_en_t val);
int32_t ism330dlc_den_enable_get(stmdev_ctx_t *ctx,
                                 ism330dlc_den_xl_en_t *val);

int32_t ism330dlc_den_mark_axis_z_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_den_mark_axis_z_get(stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t ism330dlc_den_mark_axis_y_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_den_mark_axis_y_get(stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t ism330dlc_den_mark_axis_x_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_den_mark_axis_x_get(stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t ism330dlc_mag_soft_iron_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_mag_soft_iron_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_mag_hard_iron_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_mag_hard_iron_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_mag_soft_iron_mat_set(stmdev_ctx_t *ctx,
                                        uint8_t *buff);
int32_t ism330dlc_mag_soft_iron_mat_get(stmdev_ctx_t *ctx,
                                        uint8_t *buff);

int32_t ism330dlc_mag_offset_set(stmdev_ctx_t *ctx, int16_t *val);
int32_t ism330dlc_mag_offset_get(stmdev_ctx_t *ctx, int16_t *val);

int32_t ism330dlc_sh_sync_sens_frame_set(stmdev_ctx_t *ctx,
                                         uint8_t val);
int32_t ism330dlc_sh_sync_sens_frame_get(stmdev_ctx_t *ctx,
                                         uint8_t *val);

typedef enum {
  ISM330DLC_RES_RATIO_2_11  = 0,
  ISM330DLC_RES_RATIO_2_12  = 1,
  ISM330DLC_RES_RATIO_2_13  = 2,
  ISM330DLC_RES_RATIO_2_14  = 3,
} ism330dlc_rr_t;
int32_t ism330dlc_sh_sync_sens_ratio_set(stmdev_ctx_t *ctx,
                                         ism330dlc_rr_t val);
int32_t ism330dlc_sh_sync_sens_ratio_get(stmdev_ctx_t *ctx,
                                         ism330dlc_rr_t *val);

int32_t ism330dlc_sh_master_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_sh_master_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_sh_pass_through_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_sh_pass_through_get(stmdev_ctx_t *ctx,
                                      uint8_t *val);

typedef enum {
  ISM330DLC_EXT_PULL_UP       = 0,
  ISM330DLC_INTERNAL_PULL_UP  = 1,
} ism330dlc_pull_up_en_t;
int32_t ism330dlc_sh_pin_mode_set(stmdev_ctx_t *ctx,
                                  ism330dlc_pull_up_en_t val);
int32_t ism330dlc_sh_pin_mode_get(stmdev_ctx_t *ctx,
                                  ism330dlc_pull_up_en_t *val);

typedef enum {
  ISM330DLC_XL_GY_DRDY        = 1,
  ISM330DLC_EXT_ON_INT2_PIN   = 0,
} ism330dlc_start_config_t;
int32_t ism330dlc_sh_syncro_mode_set(stmdev_ctx_t *ctx,
                                     ism330dlc_start_config_t val);
int32_t ism330dlc_sh_syncro_mode_get(stmdev_ctx_t *ctx,
                                     ism330dlc_start_config_t *val);

int32_t ism330dlc_sh_drdy_on_int1_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_sh_drdy_on_int1_get(stmdev_ctx_t *ctx,
                                      uint8_t *val);

typedef struct {
  ism330dlc_sensorhub1_reg_t   sh_byte_1;
  ism330dlc_sensorhub2_reg_t   sh_byte_2;
  ism330dlc_sensorhub3_reg_t   sh_byte_3;
  ism330dlc_sensorhub4_reg_t   sh_byte_4;
  ism330dlc_sensorhub5_reg_t   sh_byte_5;
  ism330dlc_sensorhub6_reg_t   sh_byte_6;
  ism330dlc_sensorhub7_reg_t   sh_byte_7;
  ism330dlc_sensorhub8_reg_t   sh_byte_8;
  ism330dlc_sensorhub9_reg_t   sh_byte_9;
  ism330dlc_sensorhub10_reg_t  sh_byte_10;
  ism330dlc_sensorhub11_reg_t  sh_byte_11;
  ism330dlc_sensorhub12_reg_t  sh_byte_12;
  ism330dlc_sensorhub13_reg_t  sh_byte_13;
  ism330dlc_sensorhub14_reg_t  sh_byte_14;
  ism330dlc_sensorhub15_reg_t  sh_byte_15;
  ism330dlc_sensorhub16_reg_t  sh_byte_16;
  ism330dlc_sensorhub17_reg_t  sh_byte_17;
  ism330dlc_sensorhub18_reg_t  sh_byte_18;
} ism330dlc_emb_sh_read_t;
int32_t ism330dlc_sh_read_data_raw_get(stmdev_ctx_t *ctx,
                                       ism330dlc_emb_sh_read_t *val);

int32_t ism330dlc_sh_cmd_sens_sync_set(stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t ism330dlc_sh_cmd_sens_sync_get(stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t ism330dlc_sh_spi_sync_error_set(stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t ism330dlc_sh_spi_sync_error_get(stmdev_ctx_t *ctx,
                                        uint8_t *val);

